Repository: daemon-bixia/django-api-admin
Catalog: django_api_admin/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Delete selected %(verbose_name_plural)s
ar: حذف %(verbose_name_plural)s المحددة

source: Cannot delete %(name)s
ar: لا يمكن حذف %(name)s

source: Successfully deleted %s %s.
ar: تم حذف %s %s بنجاح.

source: Successfully retrieved admin log entries
ar: تم استرجاع إدخالات سجل الإدارة بنجاح.

source: Retrieve a list of admin log entries
ar: استرجاع قائمة بإدخالات سجل الإدارة.

source: Wrong ordering field set.
ar: تم تعيين حقل ترتيب خاطئ.

source: Bad filters.
ar: فلاتر غير صحيحة.

source: Successfully constructed the list of registered models
ar: تم إنشاء قائمة النماذج المسجلة بنجاح.

source: invalid app_label
ar: تسمية التطبيق غير صالحة

source: The requested admin page does not exist.
ar: صفحة الإدارة المطلوبة غير موجودة.

source: Success Response
ar: استجابة ناجحة.

source: Example of a successful autocomplete response
ar: مثال على استجابة إكمال تلقائي ناجحة.

source: Endpoint for autocomplete functionality on model fields
ar: نقطة النهاية لوظيفة الإكمال التلقائي على حقول النموذج.

source: missing values app_label, model_name, and field_name
ar: القيم المفقودة: تسمية التطبيق، اسم النموذج، واسم الحقل

source: source model not found
ar: لم يتم العثور على نموذج المصدر

source: source field not found in source model {source_model._meta.verbose_name}
ar: لم يتم العثور على حقل المصدر في نموذج المصدر {source_model._meta.verbose_name}

source: unable to locate the related model using source field {source_field.name}
ar: غير قادر على تحديد موقع النموذج المرتبط باستخدام حقل المصدر {source_field.name}

source: the remote model is not registered in the admin
ar: النموذج البعيد غير مسجل في لوحة الإدارة

source: %s must have search_fields for the autocomplete_view."
ar: %s يجب أن يحتوي على search_fields لعرض الإكمال التلقائي.

source: Successful retrieval of the language catalog.
ar: تم استرجاع كتالوج اللغة بنجاح.

source: Example of a successful language catalog request
ar: مثال على طلب كتالوج لغة ناجح.

source: return the translation string used in this app
ar: إرجاع سلسلة الترجمة المستخدمة في هذا التطبيق.

source: Successfully returned the field attributes list
ar: تم إرجاع قائمة سمات الحقل بنجاح.

source: Successful token obtainment
ar: تم الحصول على الرمز بنجاح.

source: Example of a successful token obtain response
ar: مثال على استجابة ناجحة للحصول على الرمز.

source: Returns a pair of tokens containing both the refresh and access tokens
ar: إرجاع زوج من الرموز يحتوي على رموز التحديث والوصول.

source: you are logged in successfully
ar: تم تسجيل الدخول بنجاح

source: Successful change of the user's password
ar: تم تغيير كلمة مرور المستخدم بنجاح.

source: Example of a successful password change response
ar: مثال على استجابة ناجحة لتغيير كلمة المرور.

source: Returns a message confirming the password change
ar: إرجاع رسالة تؤكد تغيير كلمة المرور.

source: Your password was changed
ar: تم تغيير كلمة المرور الخاصة بك

source: Successful retrieval of user information
ar: تم استرجاع معلومات المستخدم بنجاح.

source: User Information
ar: معلومات المستخدم

source: Example of a successful user information retrieval response
ar: مثال على استجابة ناجحة لاسترجاع معلومات المستخدم.

source: Returns details of the user's information
ar: إرجاع تفاصيل معلومات المستخدم.

source: Successful retrieval of the object's view on site
ar: تم استرجاع عرض الكائن على الموقع بنجاح.

source: Returns a URL where the object can be viewed on the site
ar: إرجاع عنوان URL حيث يمكن عرض الكائن على الموقع.

source: Content type %(ct_id)s object has no associated model
ar: نوع المحتوى %(ct_id)s لا يحتوي على نموذج مرتبط

source: Content type %(ct_id)s object %(obj_id)s doesn’t exist
ar: نوع المحتوى %(ct_id)s الكائن %(obj_id)s غير موجود

source: %(ct_name)s objects don’t have a get_absolute_url() method
ar: كائنات %(ct_name)s لا تحتوي على دالة get_absolute_url()

source: The {opts.verbose_name} “{str(new_object)}” was added successfully.
ar: تمت إضافة {opts.verbose_name} “{str(new_object)}” بنجاح.

source: The {opts.verbose_name} “{str(updated_object)}” was changed successfully.
ar: تم تغيير {opts.verbose_name} “{str(updated_object)}” بنجاح.

source: Update Success Response
ar: استجابة نجاح التحديث.

source: Example of a successful Update operation response
ar: مثال على استجابة ناجحة لعملية التحديث.

source: The field %s cannot be referenced.
ar: لا يمكن الإشارة إلى الحقل %s.

source: %(name)s with ID “%(key)s” doesn't exist. Perhaps it was deleted?
ar: %(name)s بالمعرف “%(key)s” غير موجود. ربما تم حذفه؟

source: Retrieve a list of records with optional filtering and pagination
ar: استرجاع قائمة بالسجلات مع إمكانية التصفية والتقسيم إلى صفحات.

source: Example of a successful changelist retrieval
ar: مثال على استرجاع ناجح لقائمة التغييرات.

source: Returns a paginated list of records with optional filters applied.
ar: إرجاع قائمة بالسجلات مقسمة إلى صفحات مع تطبيق الفلاتر الاختيارية.

source: Delete Success Response
ar: استجابة نجاح الحذف.

source: Example of a successful delete operation
ar: مثال على عملية حذف ناجحة.

source: Returns a success message after deleting the selected objects
ar: إرجاع رسالة نجاح بعد حذف الكائنات المحددة.

source: The %(name)s “%(obj)s” was deleted successfully.
ar: تم حذف %(name)s “%(obj)s” بنجاح.

source: Action executed successfully on selected objects
ar: تم تنفيذ الإجراء بنجاح على الكائنات المحددة.

source: Example of a successful action execution
ar: مثال على تنفيذ ناجح للإجراء.

source: Returns a success message after performing the selected action on chosen objects
ar: إرجاع رسالة نجاح بعد تنفيذ الإجراء المحدد على الكائنات المختارة.

source: Items must be selected in order to perform actions on them. No items have been changed.
ar: يجب تحديد العناصر لتنفيذ الإجراءات عليها. لم يتم تغيير أي عناصر.

source: action was performed successfully
ar: تم تنفيذ الإجراء بنجاح

source: Administration
ar: الإدارة

source: All
ar: الكل

source: Yes
ar: نعم

source: No
ar: لا

source: Unknown
ar: غير معروف

source: Any date
ar: أي تاريخ

source: Today
ar: اليوم

source: Past 7 days
ar: آخر 7 أيام

source: This month
ar: هذا الشهر

source: This year
ar: هذا العام

source: No date
ar: لا يوجد تاريخ

source: Has date
ar: يوجد تاريخ

source: Empty
ar: فارغ

source: Not empty
ar: غير فارغ

source: A rewrite of django.contrib.admin as a Restful API, intended for usein the process of creating custom admin panels using frontend frameworks likereact, and vue while maintaining an API similar to django.contrib.admin.
ar: إعادة كتابة django.contrib.admin كواجهة برمجة تطبيقات RESTful، تهدف إلى الاستخدام في عملية إنشاء لوحات إدارة مخصصة باستخدام أطر عمل الواجهة الأمامية مثل React، و Vue مع الحفاظ على واجهة برمجة تطبيقات مشابهة لـ django.contrib.admin.

source: Addition
ar: إضافة

source: Change
ar: تغيير

source: Deletion
ar: حذف

source: action time
ar: وقت الإجراء

source: user
ar: المستخدم

source: content type
ar: نوع المحتوى

source: object id
ar: معرف الكائن

source: object repr
ar: تمثيل الكائن

source: action flag
ar: علامة الإجراء

source: change message
ar: رسالة التغيير

source: log entry
ar: إدخال السجل

source: log entries
ar: إدخالات السجل

source: Added “%(object)s”.
ar: تمت إضافة “%(object)s”.

source: Changed “%(object)s” — %(changes)s
ar: تم تغيير “%(object)s” — %(changes)s

source: Deleted “%(object)s.”
ar: تم حذف “%(object)s”.

source: LogEntry Object
ar: كائن LogEntry

source: Added {name} “{object}”.
ar: تمت إضافة {name} “{object}”.

source: Added.
ar: تمت الإضافة.

source: and
ar: و

source: Changed {fields} for {name} “{object}”.
ar: تم تغيير {fields} لـ {name} “{object}”.

source: Changed {fields}.
ar: تم تغيير {fields}.

source: Deleted {name} “{object}”.
ar: تم حذف {name} “{object}”.

source: No fields changed.
ar: لم يتم تغيير أي حقول.

source: Example of a successful field attribute response
ar: مثال على استجابة ناجحة لسمات الحقل.

source: Retrieve form field attributes for the password change endpoint
ar: استرجاع سمات حقل النموذج لنقطة نهاية تغيير كلمة المرور.

source: Permission denied
ar: تم رفض الإذن.

source: Permission Denied
ar: تم رفض الإذن.

source: Permission denied response
ar: استجابة رفض الإذن.

source: You do not have permission to perform this action.
ar: ليس لديك إذن لتنفيذ هذا الإجراء.

source: Not Found
ar: غير موجود.

source: Bad request
ar: طلب غير صالح.

source: Bad Request
ar: طلب غير صالح.

source: Invalid request parameters or data
ar: معلمات أو بيانات الطلب غير صالحة.

source: The request contains invalid parameters or data.
ar: الطلب يحتوي على معلمات أو بيانات غير صالحة.

source: Authentication required
ar: المصادقة مطلوبة.

source: Unauthorized
ar: غير مصرح.

source: Missing or invalid authentication credentials
ar: بيانات اعتماد المصادقة مفقودة أو غير صالحة.

source: Authentication credentials were not provided.
ar: لم يتم توفير بيانات اعتماد المصادقة.

source: Method not allowed
ar: الطريقة غير مسموح بها.

source: Method Not Allowed
ar: الطريقة غير مسموح بها.

source: HTTP method not supported
ar: طريقة HTTP غير مدعومة.

source: Method not allowed for this endpoint.
ar: الطريقة غير مسموح بها لهذه النقطة النهائية.

source: Resource conflict
ar: تعارض في المورد.

source: Conflict
ar: تعارض.

source: Resource conflict detected
ar: تم اكتشاف تعارض في المورد.

source: The request conflicts with the current state of the target resource.
ar: الطلب يتعارض مع الحالة الحالية للمورد المستهدف.

source: Internal server error
ar: خطأ في الخادم الداخلي.

source: Server Error
ar: خطأ في الخادم.

source: Internal server error occurred
ar: حدث خطأ في الخادم الداخلي.

source: An unexpected error occurred while processing the request.
ar: حدث خطأ غير متوقع أثناء معالجة الطلب.

source: Please login with an account that has permissions to access the admin site
ar: يرجى تسجيل الدخول بحساب لديه أذونات للوصول إلى موقع الإدارة

source: This account is inactive.
ar: هذا الحساب غير نشط.

source: Old password
ar: كلمة المرور القديمة

source: New Password
ar: كلمة المرور الجديدة

source: New password confirmation
ar: تأكيد كلمة المرور الجديدة

source: The two password fields didn’t match.
ar: حقلا كلمة المرور غير متطابقين.

source: Your old password was entered incorrectly. Please enter it again.
ar: تم إدخال كلمة المرور القديمة بشكل غير صحيح. يرجى إدخالها مرة أخرى.

source: finish must occur after start
ar: يجب أن يحدث الانتهاء بعد البدء

source: Django site admin
ar: إدارة موقع Django

source: Django administration
ar: إدارة Django

source: Site administration
ar: إدارة الموقع

source: there is no inline admin with this name in model admin
ar: لا يوجد إدارة مضمنة بهذا الاسم في إدارة النموذج
